In [1]:
import mysql.connector
from mysql.connector import errorcode


import pandas as pd
import numpy as np

In [2]:
try:
  cnx = mysql.connector.connect(user='root', password='AlumnaAdalab',
                              host='127.0.0.1')
  print("Conexion establecida")

except mysql.connector.Error as err:

  if err.errno == errorcode.ER_ACCESS_DENIED_ERROR:
    print("Something is wrong with your user name or password")
  
  elif err.errno == errorcode.ER_BAD_DB_ERROR:
    print("Database does not exist")
  
  else:
    print(err)

Conexion establecida

In [3]:
df_total_api = pd.read_csv("total_api_para_BBDD.csv", index_col = 0)

In [4]:
df_total_api.head()

         0         1                   2       3     4          5
0  comedia  pelicula  This Wretched Life  2010.0   7.0  tt0331312
1  comedia  pelicula         Blind Sided  2010.0   0.0  tt0337882
2  comedia  pelicula    Anderson's Cross  2010.0   5.0  tt0393049
3  comedia  pelicula             Tangled  2010.0  12.0  tt0398286
4  comedia  pelicula       Venus & Vegas  2010.0  11.0  tt0423474

In [5]:
lista_api_para_bbdd = df_total_api.values.tolist()

In [6]:
lista_definitiva = [tuple(peli) for peli in lista_api_para_bbdd]

In [7]:
lista_definitiva[:4]

[('comedia', 'pelicula', 'This Wretched Life', 2010.0, 7.0, 'tt0331312'),
 ('comedia', 'pelicula', 'Blind Sided', 2010.0, 0.0, 'tt0337882'),
 ('comedia', 'pelicula', "Anderson's Cross", 2010.0, 5.0, 'tt0393049'),
 ('comedia', 'pelicula', 'Tangled', 2010.0, 12.0, 'tt0398286')]

In [23]:
cnx = mysql.connector.connect(user='root', password='AlumnaAdalab',
                              host='127.0.0.1', database='bho')


mycursor = cnx.cursor()
query = "INSERT INTO api (genero, tipo, nombre_peli_api, a√±o_api, mes_api, codigo_imbd) VALUES (%s, %s, %s, %s, %s, %s)"
val = lista_definitiva

try: 
    mycursor.executemany(query, val)
    cnx.commit()
    print(mycursor.rowcount, "registro/s insertado/s.")

except mysql.connector.Error as err:
    print(err)
    print("Error Code:", err.errno)
    print("SQLSTATE", err.sqlstate)
    print("Message", err.msg)

69414 registro/s insertado/s.

In [3]:
cnx = mysql.connector.connect(user='root', password='AlumnaAdalab',
                              host='127.0.0.1', database='bho')

cnx.close()

In [8]:
lista_definitiva_2 = []
for pelicula in lista_definitiva:
    lista = list(pelicula)
    if lista[0] == "drama":
        lista.append("1")
        lista.append("0")
        lista.append("0")
    elif lista[0] == "comedia":
        lista.append("0")
        lista.append("1")
        lista.append("0")
    elif lista[0] == "accion":
        lista.append("0")
        lista.append("0")
        lista.append("1")
    tupla = tuple(lista)
    lista_definitiva_2.append(tupla)

In [10]:
len(lista_definitiva_2)

69414

In [13]:
#convertimos la lista a dataframe
df_api = pd.DataFrame(lista_definitiva_2)

df_api

             0         1                   2       3     4          5  6  7  8
0      comedia  pelicula  This Wretched Life  2010.0   7.0  tt0331312  0  1  0
1      comedia  pelicula         Blind Sided  2010.0   0.0  tt0337882  0  1  0
2      comedia  pelicula    Anderson's Cross  2010.0   5.0  tt0393049  0  1  0
3      comedia  pelicula             Tangled  2010.0  12.0  tt0398286  0  1  0
4      comedia  pelicula       Venus & Vegas  2010.0  11.0  tt0423474  0  1  0
...        ...       ...                 ...     ...   ...        ... .. .. ..
69409    drama     corto        When in Rome  2009.0   2.0  tt1362332  1  0  0
69410    drama     corto         Perspective  2009.0   0.0  tt1362288  1  0  0
69411    drama     corto           Communion  2009.0   NaN  tt1362385  1  0  0
69412    drama     corto             Closure  2009.0   6.0  tt1362383  1  0  0
69413    drama     corto     A Second Chance  2009.0   4.0  tt1362306  1  0  0

[69414 rows x 9 columns]

In [14]:
#convertimos el dataframe a csv
df_api.to_csv("api_total_genero_separado.csv")

In [15]:
try:
  cnx = mysql.connector.connect(user='root', password='AlumnaAdalab',
                              host='127.0.0.1')
  print("Conexion establecida")

except mysql.connector.Error as err:

  if err.errno == errorcode.ER_ACCESS_DENIED_ERROR:
    print("Something is wrong with your user name or password")
  
  elif err.errno == errorcode.ER_BAD_DB_ERROR:
    print("Database does not exist")
  
  else:
    print(err)

Conexion establecida

In [20]:
cnx = mysql.connector.connect(user='root', password='AlumnaAdalab',
                              host='127.0.0.1', database='bho')


mycursor = cnx.cursor()
query = "CREATE TABLE intermedia (genero ENUM ('comedia', 'drama', 'accion'), tipo ENUM ('pelicula', 'corto'), nombre_peli_api VARCHAR (200), a√±o_api YEAR, mes_api INT, codigo_imbd VARCHAR(10), drama INT, comedia INT, accion INT)"


try: 
    mycursor.execute(query)
    # cnx.commit()

except mysql.connector.Error as err:
    print(err)
    print("Error Code:", err.errno)
    print("SQLSTATE", err.sqlstate)
    print("Message", err.msg)

In [21]:
cnx = mysql.connector.connect(user='root', password='AlumnaAdalab',
                              host='127.0.0.1', database='bho')


mycursor = cnx.cursor()
query = "INSERT INTO intermedia (genero, tipo, nombre_peli_api, a√±o_api, mes_api, codigo_imbd, drama, comedia, accion) VALUES (%s, %s, %s, %s, %s, %s, %s, %s, %s)"
val = lista_definitiva_2

try: 
    mycursor.executemany(query, val)
    cnx.commit()
    print(mycursor.rowcount, "registro/s insertado/s.")

except mysql.connector.Error as err:
    print(err)
    print("Error Code:", err.errno)
    print("SQLSTATE", err.sqlstate)
    print("Message", err.msg)

69414 registro/s insertado/s.